In [3]:
import sqlite3

In [4]:
import pandas as pd

In [5]:
dir_db = 'chinook.db'
conn = sqlite3.connect(dir_db)

In [6]:
cursor = conn.cursor()

In [7]:
query = """
SELECT *
FROM genres
"""

In [8]:
mi_query = cursor.execute(query)

In [9]:
mi_query.fetchall()

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera'),
 (90, 'hola')]

In [10]:
pd.read_sql_query(query, conn)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera
25       90                hola

In [11]:
query = """
SELECT *
FROM customers, invoices
WHERE customers.CustomerID= invoices.customerID
"""
pd.read_sql_query(query, conn)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [12]:
query = """
SELECT *
FROM customers
JOIN invoices ON customers.CustomerID= invoices.customerID
"""
pd.read_sql_query(query, conn)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [13]:
query = """
SELECT c.FirstName, c.LastName, i.InvoiceId, i.InvoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId= i.customerId
WHERE  c.Country= "Brazil"
"""
pd.read_sql_query(query, conn)

    FirstName   LastName  InvoiceId          InvoiceDate BillingCountry
0        Luís  Gonçalves         98  2010-03-11 00:00:00         Brazil
1        Luís  Gonçalves        121  2010-06-13 00:00:00         Brazil
2        Luís  Gonçalves        143  2010-09-15 00:00:00         Brazil
3        Luís  Gonçalves        195  2011-05-06 00:00:00         Brazil
4        Luís  Gonçalves        316  2012-10-27 00:00:00         Brazil
5        Luís  Gonçalves        327  2012-12-07 00:00:00         Brazil
6        Luís  Gonçalves        382  2013-08-07 00:00:00         Brazil
7     Eduardo    Martins         25  2009-04-09 00:00:00         Brazil
8     Eduardo    Martins        154  2010-11-14 00:00:00         Brazil
9     Eduardo    Martins        177  2011-02-16 00:00:00         Brazil
10    Eduardo    Martins        199  2011-05-21 00:00:00         Brazil
11    Eduardo    Martins        251  2012-01-09 00:00:00         Brazil
12    Eduardo    Martins        372  2013-07-02 00:00:00         Brazil
13    Eduardo    Martins        383  2013-08-12 00:00:00         Brazil
14  Alexandre      Rocha         57  2009-09-06 00:00:00         Brazil
15  Alexandre      Rocha         68  2009-10-17 00:00:00         Brazil
16  Alexandre      Rocha        123  2010-06-17 00:00:00         Brazil
17  Alexandre      Rocha        252  2012-01-22 00:00:00         Brazil
18  Alexandre      Rocha        275  2012-04-25 00:00:00         Brazil
19  Alexandre      Rocha        297  2012-07-28 00:00:00         Brazil
20  Alexandre      Rocha        349  2013-03-18 00:00:00         Brazil
21    Roberto    Almeida         34  2009-05-23 00:00:00         Brazil
22    Roberto    Almeida        155  2010-11-14 00:00:00         Brazil
23    Roberto    Almeida        166  2010-12-25 00:00:00         Brazil
24    Roberto    Almeida        221  2011-08-25 00:00:00         Brazil
25    Roberto    Almeida        350  2013-03-31 00:00:00         Brazil
26    Roberto    Almeida        373  2013-07-03 00:00:00         Brazil
27    Roberto    Almeida        395  2013-10-05 00:00:00         Brazil
28   Fernanda      Ramos         35  2009-06-05 00:00:00         Brazil
29   Fernanda      Ramos         58  2009-09-07 00:00:00         Brazil
30   Fernanda      Ramos         80  2009-12-10 00:00:00         Brazil
31   Fernanda      Ramos        132  2010-07-31 00:00:00         Brazil
32   Fernanda      Ramos        253  2012-01-22 00:00:00         Brazil
33   Fernanda      Ramos        264  2012-03-03 00:00:00         Brazil
34   Fernanda      Ramos        319  2012-11-01 00:00:00         Brazil

In [14]:
query = """
SELECT i.*
FROM customers c
JOIN invoices i ON c.CustomerId= i.customerId
WHERE  c.Country= "Brazil"
"""
pd.read_sql_query(query, conn)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

In [15]:
query = """
SELECT e.FirstName || " " || e.LastName as Nombre, i.*
FROM employees e
JOIN customers c ON e.employeeID= c.SupportRepId
JOIN invoices i ON c.CustomerId= i.customerId
"""
pd.read_sql_query(query, conn)

,Nombre,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,Jane Peacock,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,Jane Peacock,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,Jane Peacock,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,Jane Peacock,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,Jane Peacock,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...
407,Steve Johnson,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91
408,Steve Johnson,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98
409,Steve Johnson,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96
410,Steve Johnson,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94
411,Steve Johnson,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99

In [16]:
query = """
SELECT c.FirstName, c.LastName, e.FirstName, e.LastName, c.Country= "Brazil", i.Total
FROM employees e
JOIN customers c ON e.employeeID= c.SupportRepId
JOIN invoices i ON c.CustomerId= i.customerId
"""
pd.read_sql_query(query, conn)

    FirstName    LastName FirstName LastName  c.Country= "Brazil"  Total
0        Luís   Gonçalves      Jane  Peacock                    1   3.98
1        Luís   Gonçalves      Jane  Peacock                    1   3.96
2        Luís   Gonçalves      Jane  Peacock                    1   5.94
3        Luís   Gonçalves      Jane  Peacock                    1   0.99
4        Luís   Gonçalves      Jane  Peacock                    1   1.98
..        ...         ...       ...      ...                  ...    ...
407      Puja  Srivastava      Jane  Peacock                    0   5.94
408      Puja  Srivastava      Jane  Peacock                    0   1.99
409      Puja  Srivastava      Jane  Peacock                    0   1.98
410      Puja  Srivastava      Jane  Peacock                    0  13.86
411      Puja  Srivastava      Jane  Peacock                    0   8.91

[412 rows x 6 columns]

In [17]:
query = """
SELECT t.Name, it.InvoiceId
FROM invoice_items it
JOIN invoices i ON it.InvoiceId= i.InvoiceId
JOIN tracks t ON it.TrackId = t.TrackId
"""

pd.read_sql_query(query, conn)

                               Name  InvoiceId
0               Experiment In Terra         98
1                 Take the Celestra         98
2                 Shout It Out Loud        121
3                  Calling Dr. Love        121
4                          Strutter        121
...                             ...        ...
2235           Esporrei Na Manivela        284
2236  No Fundo Do Quintal Da Escola        284
2237                 Que Luz É Essa        284
2238          The Power Of Equality        284
2239   Mellowship Slinky In B Major        284

[2240 rows x 2 columns]

In [18]:
query = """
SELECT t.Name, t.Composer, g.Name, m.Name, al.Title
FROM Tracks t
JOIN Genres g ON t.GenreId = g.GenreId
JOIN media_types m ON t.MediaTypeId = m.MediaTypeId
JOIN albums al On t.albumId= al.albumId

"""

pd.read_sql_query(query, conn)

,Name,Composer,Name,Name,Title
0,For Those About To Rock (We Salute You),"Angus Young, Malcolm Young, Brian Johnson",Rock,MPEG audio file,For Those About To Rock We Salute You
1,Balls to the Wall,None,Rock,Protected AAC audio file,Balls to the Wall
2,Fast As a Shark,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",Rock,Protected AAC audio file,Restless and Wild
3,Restless and Wild,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",Rock,Protected AAC audio file,Restless and Wild
4,Princess of the Dawn,Deaffy & R.A. Smith-Diesel,Rock,Protected AAC audio file,Restless and Wild
...,...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,None,Classical,Protected AAC audio file,Respighi:Pines of Rome
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Franz Schubert,Classical,Protected AAC audio file,Schubert: The Late String Quartets & String Qu...
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Claudio Monteverdi,Classical,Protected AAC audio file,Monteverdi: L'Orfeo
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Wolfgang Amadeus Mozart,Classical,Protected AAC audio file,Mozart: Chamber Music
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Wolfgang Amadeus Mozart,Opera,Protected AAC audio file,Mozart Gala: Famous Arias

In [22]:
query= """
SELECT  p.Name, COUNT(*) 
FROM playlists p
JOIN playlist_track pt ON p.PlaylistID= pt.PlaylistID
JOIN tracks t ON pt.TrackId = t.TrackId
GROUP BY pt.playlistId  
"""
pd.read_sql_query(query, conn)

                          Name  COUNT(*)
0                        Music      3290
1                     TV Shows       213
2                   90’s Music      1477
3                        Music      3290
4                 Music Videos         1
5                     TV Shows       213
6              Brazilian Music        39
7                    Classical        75
8    Classical 101 - Deep Cuts        25
9   Classical 101 - Next Steps        25
10  Classical 101 - The Basics        25
11                      Grunge        15
12         Heavy Metal Classic        26
13                 On-The-Go 1         1

In [23]:
query = """
SELECT e.LastName, SUM(i.Total)
FROM employees e 
JOIN customers c ON e.employeeID= c.SupportRepId
JOIN invoices i ON c.CustomerId= i.customerId
GROUP BY e.employeeId
"""
pd.read_sql_query(query, conn)

  LastName  SUM(i.Total)
0  Peacock        833.04
1     Park        775.40
2  Johnson        720.16

In [24]:
query = """
SELECT e.EmployeeId, SUM(i.Total)
FROM employees e 
JOIN customers c ON e.employeeID= c.SupportRepId
JOIN invoices i ON c.CustomerId= i.customerId
WHERE i.invoiceDate LIKE "2009%"
GROUP BY  e.employeeId
"""
pd.read_sql_query(query, conn)

   EmployeeId  SUM(i.Total)
0           3        123.75
1           4        161.37
2           5        164.34

In [28]:
query = """
SELECT ar.Name, Sum(ii.UnitPrice)
FROM artists ar
JOIN albums al ON al.artistId = ar.artistId
JOIN tracks t ON t.albumId = al.AlbumId
JOIN invoice_items ii On t.TrackId= ii.trackId
GROUP BY ar.artistId
"""

pd.read_sql_query(query, conn)

                                   Name  Sum(ii.UnitPrice)
0                                 AC/DC              15.84
1                                Accept               4.95
2                             Aerosmith               9.90
3                     Alanis Morissette               7.92
4                       Alice In Chains               6.93
..                                  ...                ...
160                        Julian Bream               0.99
161                       Martin Roscoe               0.99
162  Göteborgs Symfoniker & Neeme Järvi               0.99
163                  Michele Campanella               0.99
164              Emerson String Quartet               1.98

[165 rows x 2 columns]